{
  "jokes": [
    "Why did the computer go to the doctor? \nBecause it had a virus!",
    "What do you call a computer floating in the ocean? \nA Dell Rolling in the Deep.",
    "What is written on Steve Jobs tombstone? \niCame, iSaw, iConquered, iLeft, iCameBack, iThinkDifferent, iMac, iPod, iTunes, iPhone, iPad, iCloud, iRIP",
    "Why do Java developers wear glasses? \nBecause they don't C#.",
    "What do you call a computer that sings? \nA-Dell",
    "Where did the computer go to dance? \nTo a disc-o.",
    "Why was the computer cold at night? \nBecause it left its windows open.",
    "What is an astronaut's favorite place on a computer? \nThe Space bar!",
    "What did the dentist say to the computer? \nThis won't hurt a byte.",
    "What type of a computer does a horse like to eat? \nA Macintosh.",
    "What does Erica do when her laptop computer freezes? \nShe sticks it in the microwave!",
    "How do you know if grandma has been using a computer? \nThere's whiteout on the screen.",
    "What do you call a woman you married off the internet? \nWife-I.",
    "What does a baby computer calls its father? \nObsolete",
    "What do you get if you cross a computer with a ballet dancer? \nThe Netcracker suite.",
    "What does a king computer do? \nExecute his programs!",
    "Why don't some people take their iPhones to the bathroom? \nBecause they don't want to give away their IP address!",
    "How do you get a computer drunk? \nA Screenshot of Tequila.",
    "Why couldn't Bill Gates get a mistress? \nBecause he's penis was MICROSOFT!",
    "What part of a computer does a spider use? \nThe webcam.",
    "What happens when a Buddhist becomes totally absorbed with the computer he is working with? \nHe enters Nerdvana.",
    "Why did Jack and Jill \"really\" go up the hill? \nTo get better Wi-fi.",
    "Why was the computer shy? \nBecause it had hardware and software but no underware.",
    "What was the spider doing on the computer? \nSearching the web!",
    "Why can't an elephant use a computer? \nHe's too afraid of the mouse.",
    "What do you get when you cross a hamburger with a computer? \nA big mac!",
    "How are elephants and computers similar? \nThey both have big memories.",
    "How did the spider destroy the (worldwide) web? \nIt gave it a bug.",
    "Why did Mark Zuckerberg visit Beijing, China? \nTo see the \"Great Firewall\".",
    "Why are PCs like air conditioners? \nThey stop working properly if you open Windows!",
    "What did mommy spider say to baby spider? \nYou spend too much time on the web.",
    "What was the hipster doing at the computer? \nLooking in the recycling bin for something retro.",
    "Why did the computer break up with the internet? \nThere was no \"Connection\".",
    "Why was the computer tired when it got home? \nIt had a \"hard drive\"",
    "What do you call a country with slow internet speeds? \nAmerica Online.",
    "Why did the boy lick the USB port? \nBecause he was an etard.",
    "What's the difference between Paul Walker and a computer? \nI actually care when my computer crashes.",
    "Why did the computer go to the dentist? \nBecause it had Bluetooth.",
    "How many programmers does it take to change a light bulb? \nNone, that's a hardware problem.",
    "What do you call an iPhone that isn't kidding around? \nDead Siri-ous",
    "What is the difference between a redhead and a computer? \nRedhead won't accept a three and a half inch.",
    "What did the turkey say to the computer? \nGoogle, google, google!",
    "How do trees use a computer? \nThey log in!",
    "What's the difference between an Linux and a virus? \nA virus does something.",
    "What kind of party does a laptop go to? \nA CISCO party.",
    "How do you know you are using Linux? \nYour computer only has 4 modes: Abort, Retry, Fail and Reboot!",
    "Why did the powerpoint maker cross the road? \nTo get to the other slide!",
    "How many Microsoft programmers does it take to change a lightbulb? \nNone. Bill Gates will just redefine Darkness(TM) as the new industry standard.",
    "What do you call a brunette in between 2 French blondes visiting America? \nGoogle translate.",
    "What do you call an egg who is on the computer too much? \nAn \"Egg Head\"",
    "What's the difference between a virus and Windows Vista? \nViruses rarely fail.",
    "Person1: Aren't we all internet explorers? \nPerson2: You mean we run slow and no one likes us.",
    "Somebody stole my new Microsoft Office last week and they are going to pay! \nYou have my Word!",
    "When I die, I want my tombstone to be a WiFi hotspot......that way people visit more often.",
    "Why are iPhone chargers not called Apple Juice?!?",
    "Yo momma so fat and dumb, she tears apart computers looking for cookies.",
    "A SQL query goes into a bar, walks up to two tables and asks, \"Can I join you?\"",
    "If your computer is slow paint a Jamaican flag on it and it will run faster.",
    "I mustache you a question, can eyebrows your computer?",
    "I farted in the Apple store and everyone got pissed at me. Not my fault they don't have Windows.",
    "\"Do you like computers?\" (yes.) \"Do you like file sharing?\" (yes) \"Good, 'cause I'm downloadable and user friendly!\"",
    "So this person went to the doctor and told the doctor he had an addiction to twitter and the doctor said well I am not following.",
    "Macs are for those who don't want to know why their computer works. \nLinux is for those who want to know why their computer works. \nDOS is for those who want to know why their computer doesn't work. \nWindows is for those who don't want to know why their computer doesn't work.",
    "A physicist, a mathematician and a computer programmer discuss what is better: a wife or a girlfriend. \nThe physicist: \"A girlfriend. You still have freedom to experiment.\" \nThe mathematician: \"A wife. You have security.\" \nThe computer programmer: \"Both. When I'm not with my wife, she thinks I'm with my girlfriend. With my girlfriend it's vice versa. And I can be with my computer without anyone disturbing me...\" ",
    "Computer Definitions \n\n1) 486 \nThe average IQ needed to understand a PC. \n2) State-of-the-art\n Any computer you can't afford. \n3) Obsolete\n Any computer you own. \n4) Microsecond\n The time it takes for your state-of-the-art computer to become obsolete.",
    "The worlds richest man Bill Gates dies and goes to St Peter... St Peter is embarrased. \n\"I don't know what to do with you Bill ... you put a PC in every household ... on the other hand you made windows Vista. So I tell you what ... just chose between heaven and hell\" \nBill goes \"Really, I can chose?\" \n\"Yes pick one\" Peter says. \nBill who is very professionnal: \"Ok, can I visit both before deciding?\" \n\"Ok, just go's on. What do you want to start with?\" \nBill: \"... why not start with hell?\" \nAnd then they both went to hell. \nMagnificient. Great beaches, plenty sun and naked women every where, smiling at Bill. \n\"That looks wonderfull\" Bill says. Now how about heaven? Then then went to heaven. \nMagnificient. Great beaches, plenty sun, just no naked women \n\"Ok\" Bill says, \"I pick hell then.\" \nAfter a week St Peter decided to visit Bill who was sent to Hell The poor guy was on the floor, screaming, scratching the ground with his nails. \nHe shouted at St Peter: \"No no no! I Can't stand it no more!\" \n\"What's wrong\" St Peter asked? \nBill goes \"I don't understand, there is nothing to do with what I saw the first time\" \"Where is the beach? The naked women?\" \nAnd St Peter: \"That was just a demo.\"",
    "Virus? \nNo, Windows is not a virus. Here's what viruses do: \nThey replicate quickly - okay, Windows does that. \nViruses use up valuable system resources, slowing down the system as they do so - okay, Windows does that. \nViruses will, from time to time, trash your hard disk - okay, Windows does that too. \nViruses are usually carried, unknown to the user, along with valuable programs and systems. Sigh... Windows does that, too. \nViruses will occasionally make the user suspect their system is too slow (see 2) and the user will buy new hardware. Yup, that's with Windows, too. \nUntil now it seems Windows is a virus but there are fundamental differences: Viruses are well supported by their authors, are running on most systems, their program code is fast, compact and efficient and they tend to become more sophisticated as they mature. \nSo Windows is not a virus. \nIt's a bug.",
    "Q: Why are PCs like air conditioners? \nA: They stop working properly if you open Windows!",
    "Q: What if Bill Gates had a dime for every time Windows Vista crashed... \nA: Oh, wait a minute, he already does!",
    "Q: What do you call Windows Multitasking? \nA: Screwing up several things at once!",
    "Q: What do houses and Microsoft Windows have in common? \nA: Bugs come in through open Windows.",
    "Windows XP 32 bit extensions and a graphical shell for a 16 bit patch to an 8 bit operating system originally coded for a 4 bit microprocessor, written by a 2 bit company, that can't stand 1 bit of competition.",
    "If Microsoft was headquartered in the Deep South \n1. Their #1 product would be Microsoft Winders. \n2. Instead of an hourglass icon you'd get an empty beer bottle. \n3. Dialog boxes would give you the choice of \"Ahh-right\" or \"Naw.\" \n4. The \"Recycle Bin\" in Winders '7 would be an outhouse. \n5. PowerPoint would be named \"ParPawnt.\" \n6. Microsoft's programming tools would be \"Vishul Basic\" and \"Vishul C++.\" \n7. Winders 7 logo would incorporate the Confederate Flag. \n8. Instead of VP, Microsoft big shots would be called \"Cuz.\" \n9. Hardware could be repaired using parts from an old Trans Am. \n10. Four words: Daisy Dukes Screen Saver. \n11. Flight Simulator replaced by Tractor pull Simulator. \n12. Microsoft CEO: Bubba Gates."
  ]
}
